programming/algorithm/algorithm4th/algorithm.org
#+TITLE: Algorithm 4th 笔记
#+AUTHRO: Zhao WenBin

* 说明

本笔记整理以下教材和教程
1. 阅读 Algorithm Fourth Edition
2. Coursera Algorithm Part1

以 Algorithm 4th 课本目录结构为主线，整合了 Coursera 中的视频笔记

* Foundamentals

** Bags, Queues, and Stacks

*** 概述

本节主要讲了三种数据结构，其基本操作包括 add, isEmpty 和 size。 

Bags 为无序集合，但实际实现时为了简化，与 Stack 一致（使用时不假定顺序）

Queue 与 Stack 支持取出数据，入队和出队次序有所不同:
- Queue 为 FIFO
  + =enqueue= 向队尾插入数据
  + =dequeue= 从队头取出数据
- Stack 为 FILO
  + =push= 向栈顶压入数据
  + =pop= 弹出栈顶数据

此外，讲解了 Java 中的三个语言特性

1. Generic（泛型）

   定义类时指定 parameterized type，在实现中对泛型进行操作，而具体生成时指定具体类型

2. AutoBoxing

   Java 中 int, double, float 等原始类型不能作为泛型要求的类型参数（要求是引用类型），为此可以使用 Integer 替代 =int= 类型。编译器会自动在两种类型之间进行转换，由原始类型变为引用类型称为 boxing，由引用类型变为原始类型称为 unboxing

3. Iterable Collections

   Java 中支持 =for( Item e: coll ) {...}= 的语法，与 Python 中的 iterator 一致，要求 =coll= 对象有 =iterator= 方法，返回一个 =Iterable= 对象，并对其进行迭代。这种语法称为 foreach statement


本节目的在于演示设计数据结构的基本思路
1. specify API
2. Develop client code with reference to specific application
3. Describe a data structure to implement ADT
4. Describe algorithm
5. Analyze the performance characteristics of the algorithm

*** Linked List

Java 中没有指针，用引用来实现链表
#+BEGIN_SRC java 
  class Node {
      Item item;
      Node next;
  }
#+END_SRC

链表的基本操作
1. insert at the beginning
2. remove from the beginning
3. insert at the end
4. insert at other positions: O(n)
5. remove at other positions: O(n)

*** Pushdown Stack

栈的特性为 LIFO。 E.W.Dijkstra 使用两个栈，分别保存 operator 和 operand，来实现算术表达式的求解

有两种实现方式

1. 数组方式
   + 底层用一个大小为 N 的数组来保存
   + 维护一个栈顶的 index
   + 考虑动态伸缩数组（reallocate）
     - 当 push 操作填满数组时，进行扩展，将底层数组扩大为 2N
     - 当 pop 操作减少数量至四分之一时，缩小底层数组为 N/2 （选择四分之一，避免重复扩展）
     - 虽然能达到动态效果，但复制内容开销过大
   + pop 时需要将清理弹出的数据（loiter，即赋值为 null），以触发 GC
   + 继承 Iterable 接口，iterator 方法，返回 Iterator 对象 (=java.util.Iterator=)
     - hasNext
     - next，为空时抛出 NoSuchElementException 异常
     - remove（不实现）
2. 单链表方式
   + 定义一个内部类
     #+BEGIN_SRC java
       private class Node {
	   Item item;
	   Node next;
       }
     #+END_SRC
   + 维护一个到 Node 的引用（栈）
   + 插入数据相当于生成新的 Node，插入到列表头部
   + 删除数据相当于列表中摘取头部 Node
   + 空间占用与实际元素数量一致

*** FIFO Queue

以单链表方式来实现，与 Stack 方式类型，关键元素有
1. =first= 引用链表头
2. =last= 引用链表尾
3. =N= 记录链表总长度

需要注意
1. 插入操作，链表为空的情况。此时应当特殊处理 first，使引用 last
2. 删除操作，链表为空的情况。此时应当特殊处理 last，指向 null

*** Bags

与 Pushdown Stack 的单链表实现方式一致

*** Iterator

以上三个类为了支持 =foreach= 语句
- 需要实现接口 =java.lang.Iterable= 并实现 =iterator= 方法
- 返回一个 =java.util.Iterable= 对象
- 在该对象中缓存着当前访问到的元素中间状态
- 通过 hasNext 和 next 方法来迭代操作每个元素
- 有利于统一对 sequence 和 collection 的迭代操作方式，隐藏底层实现（ Clojure 尤为强调这一点）

** Union-Find

** 概述

Union-Find 也叫作动态连接问题（Dynamic Connectivity），对点集进行动态连接操作，并能实时查询两个点之间是否有直接或间接的通联关系

该算法可以应用于多种应用场景，如
- network 检查子网间的通联性
- variable-name equivalence，检查编程语言中变量名是否引用同一对象（Fortran）
- Mathematical sets，对集合进行分类

算法几个基本术语如下所示
- connection :: 两点之间有连接
- connected components :: 相互连接的点构成的集合

本章通过介绍 union-find 的四种算法设计，强调了算法设计的基本步骤
1. 好的算法可以解决原本不可能解决的问题
2. 好算法可以使实现更为简洁
3. 分析算法性能
4. 如何选择算法
5. 逐步优化算法

** Quick Find

- 使用 =id[]= 数组保存各个点的分组情况
- 当建立新的连接时，遍历修改 =id[p]= 相同的组 id 为 =id[q]=

** Quick Union

- =id[i]= 指向父结点，子与父同属一个组
- 检查是否通联，只需要检查两个结点是否有相同的 root 结点
- 通过递归向上找父结点，直到 ~id[i] == i~ 时，该节点为 root
- 虽然不用扫描全表，但最差情况找 root 仍为 $O(n)$
- 合并时，将左树的 root 指向右树的 root

** Weighted Quick Union

- 用一个单独的数组，记录每棵树的大小
- 合并时将小树合并到大树上，避免树增长过快
- 查找、检查联接、合并的时间复杂度不超过 $\lg(N)$

** Weighted Quick Union with Path Compression

- 在 find 向上递归找 root 节点的操作时，遍历过程中将节点的 parent 直接指向 root
- 实际效果接近 constant time per operation
- 与 Weighted Quick Union 效率相当

** Performance

| algorithm                                  | constructor | union       | find        |
|--------------------------------------------+-------------+-------------+-------------|
| quick-find                                 | N           | N           | 1           |
| quick-union                                | N           | tree-height | tree-height |
| weighted quick union                       | N           | lgN         | lgN         |
| weighted quick union with path compression | N           | nearly 1    | nearly 1    |
| impossible                                 | N           | 1           | 1           |


* Sorting

从两方面来考虑排序的性能：

1. 时间
2. 额外的空间占用


** Elementary Sorts
*** Select sort

 选中剩余数列中的最小一个，与开头的元素交换

 进行 $N^2/2$ 次比较，N 次交换

 特点：
 1. 运行时间与输入元素顺序无关
 2. 交换次数最少！


 #+BEGIN_SRC java
   public void sort(Comparable[] a ) {
       int N = a.lenght;
       for ( int i = 0; i < N; i++ ) {
	   min = i
	   for ( int j = i+1; j < N; j++ ) {
	       if ( less(a[j], a[min]) ) {
		   min = j;
	       }
	   }
	   exch(a, min, i );
       }
   }
 #+END_SRC

*** Insert sort


 将新的元素插入到已经排好序的子序列中，插入操作涉及到局部的后移

 平均需要 $N^2/2$ 次比较和 $N^2/2$ 次交换

 特点有：
 1. 对于已经有序的输入，其需要比较 $N-1$ 次，不需要交换，性能大大优于选择排序
 2. 对于 partial sorted array，插入排序优势明显
 3. The number of exchanges used by insertion sort is equal to the number of inversions in the array
 4. the number of compares is at least equal to the number of inversions and at most equal to the number of inversions plus the array size minus 1.



 #+BEGIN_SRC java
   public void sort(Comparable[] a) {
       int N = a.length;
       for ( int i = 1; i < N; i++ ) {
	   for ( int j = i; j >= 0 && less(a[j], a[j-1]); j-- ) {
	       exch( a, j, i-1 );
	   }
       }
   }
 #+END_SRC
*** Shell sort


 对 Insert Sort 的优化：由于 insert sort 比较仅针对前一个元素，如果数组逆序严重，则需要太多次的比较和交换

 Shell Sort 增大了比较的跨度，生成 partially sorted array，优化 insert sort 速度

 Shell Sort 选择一个合适的 h 值，h 从大到小减小到 1，每次排序后生成 h-sorted array

 书中给出的经验公式为 $h = \frac{1}{2} ( 3^k - 1 )$

 Shellsort gains efficiency by making a tradeoff between size and partial order in the subsequences.

 最差情况下，shell sort 的时间复杂度为 $N^\frac{3}{2}$

 #+BEGIN_SRC java
   public static void sort(Comparable[] a) {
       int N = a.length;
       int h = 1;
       while( h < N/3 ) h = 3*h + 1;
       while( h >= 1 ) {
	   for ( int i = h; i < N; i++ ) {
	       for ( int j = i; j >= 0 && less(a[j], a[j-h]); j-=h ) {
		   exch(a, j, j-h);
	       }
	   }
	   h = h/3;
       }
   }
 #+END_SRC
*** SelectSort vs InsertSort

 - Property D. :: The running times of insertion sort and selection sort are quadratic and within a small constant factor of one another for randomly ordered arrays of distinct values.

** Merge sort


分治的思路 (divide and conquer)，将数组分成两部分分别进行排序，将已经排序好的两个序列进行合并

优势在于它的复杂度为 $N \log(N)$ ，劣势在于需要额外的 N 的空间来进行合并

- PropositionF. :: Top-down mergesort uses between 1⁄2NlgN and NlgN compares to sort any array of length N.
- PropositionG. :: Top-down mergesort uses at most 6NlgN array accesses to sort an array of length N.
- PropositionH. :: Bottom-upmergesortusesbetween1⁄2NlgNandNlgNcompares and at most 6N lg N array accesses to sort an array of length N.


优化思路：
1. 对于足够小的数组，使用 insert sort 替换 merge sort （如 15 个元素以下）
2. 合并前判断 mid 与 mid+1 是否已经有序
3. 去掉额外的用于合并结构存储空间

** QuickSort

** HeapSort

* 视频笔记

视频与课本相关，后续将下面的章节分类到课本的章节中去

** Union Find

*** 概述

对于给出的点集，检查各个点的联通性问题（dynamic connectivity problem）。

Union-Find 问题有两个基本操作 union 和 find，用 API 形式表示如下
| method                             | description                   |
|------------------------------------+-------------------------------|
| =UF(int N)=                        | 初始化 N 个 object 构成的点集 |
| =void union(int p, int q)=         | 连接 p 和 q 两个 object       |
| =boolean connection(int p, int q)= | 检查 p 和 q 两个 object 是否相连       |

为了简化实现，用 index array 来存储点，以下标来进行标识。如果要实现通用的点集，可以考虑使用 symbol table

解决 union-find 问题有四种数据结构
1. quick find
2. quick union
3. weighted quick union
4. weighted quick union with path compression

常用于 percolation problem from physical chemistry

本节演示了如何设计一个算法
1. modeling the problem
2. find algorithm
3. fast enough? fits memory?
4. if not, figure out why
5. find a way to address the problem
6. iterate until staisfied

*** Quick Find

其本思路是
1. 初始化时，用不同的 id 来标识不同的组（数组的索引）
2. 进行 union 操作时，遍历数组，将符合 p 对应的组 id 修改为 q 的组 id
   #+BEGIN_SRC java
     void union(int p, int q) {
	 int pid = A[p];
	 int qid = A[q];
	 for(int i = 0; i < N; i++) {
	     if(A[i] == pid) {
		 A[i] = qid;
	     }
	 }
     }
   #+END_SRC
3. 随着连接变多，组渐变少

本方法对应的算法复杂度如下所示
| method  | complexity |
|---------+------------|
| initial | N          |
| union   | N          |
| find    | 1          |

看出，当 N 较大时，union 开销较大

*** Quick Union

*** Weighted Quick Union

*** Weighted Quick Union with Path Compression

*** Analysis of Algorithm

计算机发展中，处理性能和内存同时提升。而处理性能的提升与因为内存增大而造成的处理器的提升成线性比例。也就是说曾经处理性能为 P 时，处理 Q 量的数据；现在处理性能为 1000P 时可能要求处理 1000Q 的数据。对于算法复杂度为 $O(n^2)$ 的情况，实际上性能不升反降

*** Performance Versus


** 其它
*** TODO Symbol Table
* 延伸阅读

- An Introduction to programming in Java: An interdisciplinary approach
