programming/algorithm/algorithm4th/algorithm.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-03-21 三 17:10 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Algorithm 4th 笔记</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Larry">
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">Algorithm 4th 笔记</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5ac20c0">说明</a></li>
<li><a href="#org973ddde">Foundamentals</a></li>
<li><a href="#org1a39981">Sorting</a></li>
<li><a href="#orge10292a">视频笔记</a></li>
<li><a href="#org461d7cb">延伸阅读</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org5ac20c0" class="outline-2">
<h2 id="org5ac20c0">说明</h2>
<div class="outline-text-2" id="text-org5ac20c0">
<p>
本笔记整理以下教材和教程
</p>
<ol class="org-ol">
<li>阅读 Algorithm Fourth Edition</li>
<li>Coursera Algorithm Part1</li>
</ol>

<p>
以 Algorithm 4th 课本目录结构为主线，整合了 Coursera 中的视频笔记
</p>
</div>
</div>

<div id="outline-container-org973ddde" class="outline-2">
<h2 id="org973ddde">Foundamentals</h2>
<div class="outline-text-2" id="text-org973ddde">
</div><div id="outline-container-org10ee810" class="outline-3">
<h3 id="org10ee810">Bags, Queues, and Stacks</h3>
<div class="outline-text-3" id="text-org10ee810">
</div><div id="outline-container-org956fbf5" class="outline-4">
<h4 id="org956fbf5">概述</h4>
<div class="outline-text-4" id="text-org956fbf5">
<p>
本节主要讲了三种数据结构，其基本操作包括 add, isEmpty 和 size。 
</p>

<p>
Bags 为无序集合，但实际实现时为了简化，与 Stack 一致（使用时不假定顺序）
</p>

<p>
Queue 与 Stack 支持取出数据，入队和出队次序有所不同:
</p>
<ul class="org-ul">
<li>Queue 为 FIFO
<ul class="org-ul">
<li><code>enqueue</code> 向队尾插入数据</li>
<li><code>dequeue</code> 从队头取出数据</li>
</ul></li>
<li>Stack 为 FILO
<ul class="org-ul">
<li><code>push</code> 向栈顶压入数据</li>
<li><code>pop</code> 弹出栈顶数据</li>
</ul></li>
</ul>

<p>
此外，讲解了 Java 中的三个语言特性
</p>

<ol class="org-ol">
<li><p>
Generic（泛型）
</p>

<p>
定义类时指定 parameterized type，在实现中对泛型进行操作，而具体生成时指定具体类型
</p></li>

<li><p>
AutoBoxing
</p>

<p>
Java 中 int, double, float 等原始类型不能作为泛型要求的类型参数（要求是引用类型），为此可以使用 Integer 替代 <code>int</code> 类型。编译器会自动在两种类型之间进行转换，由原始类型变为引用类型称为 boxing，由引用类型变为原始类型称为 unboxing
</p></li>

<li><p>
Iterable Collections
</p>

<p>
Java 中支持 <code>for( Item e: coll ) {...}</code> 的语法，与 Python 中的 iterator 一致，要求 <code>coll</code> 对象有 <code>iterator</code> 方法，返回一个 <code>Iterable</code> 对象，并对其进行迭代。这种语法称为 foreach statement
</p></li>
</ol>


<p>
本节目的在于演示设计数据结构的基本思路
</p>
<ol class="org-ol">
<li>specify API</li>
<li>Develop client code with reference to specific application</li>
<li>Describe a data structure to implement ADT</li>
<li>Describe algorithm</li>
<li>Analyze the performance characteristics of the algorithm</li>
</ol>
</div>
</div>

<div id="outline-container-org1ddb00a" class="outline-4">
<h4 id="org1ddb00a">Linked List</h4>
<div class="outline-text-4" id="text-org1ddb00a">
<p>
Java 中没有指针，用引用来实现链表
</p>
<div class="org-src-container">
<pre class="src src-java">class Node {
    Item item;
    Node next;
}
</pre>
</div>

<p>
链表的基本操作
</p>
<ol class="org-ol">
<li>insert at the beginning</li>
<li>remove from the beginning</li>
<li>insert at the end</li>
<li>insert at other positions: O(n)</li>
<li>remove at other positions: O(n)</li>
</ol>
</div>
</div>

<div id="outline-container-orge922f30" class="outline-4">
<h4 id="orge922f30">Pushdown Stack</h4>
<div class="outline-text-4" id="text-orge922f30">
<p>
栈的特性为 LIFO。 E.W.Dijkstra 使用两个栈，分别保存 operator 和 operand，来实现算术表达式的求解
</p>

<p>
有两种实现方式
</p>

<ol class="org-ol">
<li>数组方式
<ul class="org-ul">
<li>底层用一个大小为 N 的数组来保存</li>
<li>维护一个栈顶的 index</li>
<li>考虑动态伸缩数组（reallocate）
<ul class="org-ul">
<li>当 push 操作填满数组时，进行扩展，将底层数组扩大为 2N</li>
<li>当 pop 操作减少数量至四分之一时，缩小底层数组为 N/2 （选择四分之一，避免重复扩展）</li>
<li>虽然能达到动态效果，但复制内容开销过大</li>
</ul></li>
<li>pop 时需要将清理弹出的数据（loiter，即赋值为 null），以触发 GC</li>
<li>继承 Iterable 接口，iterator 方法，返回 Iterator 对象 (<code>java.util.Iterator</code>)
<ul class="org-ul">
<li>hasNext</li>
<li>next，为空时抛出 NoSuchElementException 异常</li>
<li>remove（不实现）</li>
</ul></li>
</ul></li>
<li>单链表方式
<ul class="org-ul">
<li><p>
定义一个内部类
</p>
<div class="org-src-container">
<pre class="src src-java">private class Node {
    Item item;
    Node next;
}
</pre>
</div></li>
<li>维护一个到 Node 的引用（栈）</li>
<li>插入数据相当于生成新的 Node，插入到列表头部</li>
<li>删除数据相当于列表中摘取头部 Node</li>
<li>空间占用与实际元素数量一致</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orge8d0462" class="outline-4">
<h4 id="orge8d0462">FIFO Queue</h4>
<div class="outline-text-4" id="text-orge8d0462">
<p>
以单链表方式来实现，与 Stack 方式类型，关键元素有
</p>
<ol class="org-ol">
<li><code>first</code> 引用链表头</li>
<li><code>last</code> 引用链表尾</li>
<li><code>N</code> 记录链表总长度</li>
</ol>

<p>
需要注意
</p>
<ol class="org-ol">
<li>插入操作，链表为空的情况。此时应当特殊处理 first，使引用 last</li>
<li>删除操作，链表为空的情况。此时应当特殊处理 last，指向 null</li>
</ol>
</div>
</div>

<div id="outline-container-org0d950e9" class="outline-4">
<h4 id="org0d950e9">Bags</h4>
<div class="outline-text-4" id="text-org0d950e9">
<p>
与 Pushdown Stack 的单链表实现方式一致
</p>
</div>
</div>

<div id="outline-container-org9ffc58f" class="outline-4">
<h4 id="org9ffc58f">Iterator</h4>
<div class="outline-text-4" id="text-org9ffc58f">
<p>
以上三个类为了支持 <code>foreach</code> 语句
</p>
<ul class="org-ul">
<li>需要实现接口 <code>java.lang.Iterable</code> 并实现 <code>iterator</code> 方法</li>
<li>返回一个 <code>java.util.Iterable</code> 对象</li>
<li>在该对象中缓存着当前访问到的元素中间状态</li>
<li>通过 hasNext 和 next 方法来迭代操作每个元素</li>
<li>有利于统一对 sequence 和 collection 的迭代操作方式，隐藏底层实现（ Clojure 尤为强调这一点）</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org47b603f" class="outline-3">
<h3 id="org47b603f">Union-Find</h3>
</div>

<div id="outline-container-org385dcd1" class="outline-3">
<h3 id="org385dcd1">概述</h3>
<div class="outline-text-3" id="text-org385dcd1">
<p>
Union-Find 也叫作动态连接问题（Dynamic Connectivity），对点集进行动态连接操作，并能实时查询两个点之间是否有直接或间接的通联关系
</p>

<p>
该算法可以应用于多种应用场景，如
</p>
<ul class="org-ul">
<li>network 检查子网间的通联性</li>
<li>variable-name equivalence，检查编程语言中变量名是否引用同一对象（Fortran）</li>
<li>Mathematical sets，对集合进行分类</li>
</ul>

<p>
算法几个基本术语如下所示
</p>
<dl class="org-dl">
<dt>connection</dt><dd>两点之间有连接</dd>
<dt>connected components</dt><dd>相互连接的点构成的集合</dd>
</dl>

<p>
本章通过介绍 union-find 的四种算法设计，强调了算法设计的基本步骤
</p>
<ol class="org-ol">
<li>好的算法可以解决原本不可能解决的问题</li>
<li>好算法可以使实现更为简洁</li>
<li>分析算法性能</li>
<li>如何选择算法</li>
<li>逐步优化算法</li>
</ol>
</div>
</div>

<div id="outline-container-orgfb21c64" class="outline-3">
<h3 id="orgfb21c64">Quick Find</h3>
<div class="outline-text-3" id="text-orgfb21c64">
<ul class="org-ul">
<li>使用 <code>id[]</code> 数组保存各个点的分组情况</li>
<li>当建立新的连接时，遍历修改 <code>id[p]</code> 相同的组 id 为 <code>id[q]</code></li>
</ul>
</div>
</div>

<div id="outline-container-org5add027" class="outline-3">
<h3 id="org5add027">Quick Union</h3>
<div class="outline-text-3" id="text-org5add027">
<ul class="org-ul">
<li><code>id[i]</code> 指向父结点，子与父同属一个组</li>
<li>检查是否通联，只需要检查两个结点是否有相同的 root 结点</li>
<li>通过递归向上找父结点，直到 <code>id[i] == i</code> 时，该节点为 root</li>
<li>虽然不用扫描全表，但最差情况找 root 仍为 \(O(n)\)</li>
<li>合并时，将左树的 root 指向右树的 root</li>
</ul>
</div>
</div>

<div id="outline-container-org353fe21" class="outline-3">
<h3 id="org353fe21">Weighted Quick Union</h3>
<div class="outline-text-3" id="text-org353fe21">
<ul class="org-ul">
<li>用一个单独的数组，记录每棵树的大小</li>
<li>合并时将小树合并到大树上，避免树增长过快</li>
<li>查找、检查联接、合并的时间复杂度不超过 \(\lg(N)\)</li>
</ul>
</div>
</div>

<div id="outline-container-org8a2a7fb" class="outline-3">
<h3 id="org8a2a7fb">Weighted Quick Union with Path Compression</h3>
<div class="outline-text-3" id="text-org8a2a7fb">
<ul class="org-ul">
<li>在 find 向上递归找 root 节点的操作时，遍历过程中将节点的 parent 直接指向 root</li>
<li>实际效果接近 constant time per operation</li>
<li>与 Weighted Quick Union 效率相当</li>
</ul>
</div>
</div>

<div id="outline-container-orgbc652ed" class="outline-3">
<h3 id="orgbc652ed">Performance</h3>
<div class="outline-text-3" id="text-orgbc652ed">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">algorithm</th>
<th scope="col" class="org-left">constructor</th>
<th scope="col" class="org-left">union</th>
<th scope="col" class="org-left">find</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">quick-find</td>
<td class="org-left">N</td>
<td class="org-left">N</td>
<td class="org-left">1</td>
</tr>

<tr>
<td class="org-left">quick-union</td>
<td class="org-left">N</td>
<td class="org-left">tree-height</td>
<td class="org-left">tree-height</td>
</tr>

<tr>
<td class="org-left">weighted quick union</td>
<td class="org-left">N</td>
<td class="org-left">lgN</td>
<td class="org-left">lgN</td>
</tr>

<tr>
<td class="org-left">weighted quick union with path compression</td>
<td class="org-left">N</td>
<td class="org-left">nearly 1</td>
<td class="org-left">nearly 1</td>
</tr>

<tr>
<td class="org-left">impossible</td>
<td class="org-left">N</td>
<td class="org-left">1</td>
<td class="org-left">1</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>


<div id="outline-container-org1a39981" class="outline-2">
<h2 id="org1a39981">Sorting</h2>
<div class="outline-text-2" id="text-org1a39981">
<p>
从两方面来考虑排序的性能：
</p>

<ol class="org-ol">
<li>时间</li>
<li>额外的空间占用</li>
</ol>
</div>


<div id="outline-container-org9742eb5" class="outline-3">
<h3 id="org9742eb5">Elementary Sorts</h3>
<div class="outline-text-3" id="text-org9742eb5">
</div><div id="outline-container-org06c47a6" class="outline-4">
<h4 id="org06c47a6">Select sort</h4>
<div class="outline-text-4" id="text-org06c47a6">
<p>
选中剩余数列中的最小一个，与开头的元素交换
</p>

<p>
进行 \(N^2/2\) 次比较，N 次交换
</p>

<p>
特点：
</p>
<ol class="org-ol">
<li>运行时间与输入元素顺序无关</li>
<li>交换次数最少！</li>
</ol>


<div class="org-src-container">
<pre class="src src-java">public void sort(Comparable[] a ) {
    int N = a.lenght;
    for ( int i = 0; i &lt; N; i++ ) {
	min = i
	for ( int j = i+1; j &lt; N; j++ ) {
	    if ( less(a[j], a[min]) ) {
		min = j;
	    }
	}
	exch(a, min, i );
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org88c149c" class="outline-4">
<h4 id="org88c149c">Insert sort</h4>
<div class="outline-text-4" id="text-org88c149c">
<p>
将新的元素插入到已经排好序的子序列中，插入操作涉及到局部的后移
</p>

<p>
平均需要 \(N^2/2\) 次比较和 \(N^2/2\) 次交换
</p>

<p>
特点有：
</p>
<ol class="org-ol">
<li>对于已经有序的输入，其需要比较 \(N-1\) 次，不需要交换，性能大大优于选择排序</li>
<li>对于 partial sorted array，插入排序优势明显</li>
<li>The number of exchanges used by insertion sort is equal to the number of inversions in the array</li>
<li>the number of compares is at least equal to the number of inversions and at most equal to the number of inversions plus the array size minus 1.</li>
</ol>



<div class="org-src-container">
<pre class="src src-java">public void sort(Comparable[] a) {
    int N = a.length;
    for ( int i = 1; i &lt; N; i++ ) {
	for ( int j = i; j &gt;= 0 &amp;&amp; less(a[j], a[j-1]); j-- ) {
	    exch( a, j, i-1 );
	}
    }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org8517092" class="outline-4">
<h4 id="org8517092">Shell sort</h4>
<div class="outline-text-4" id="text-org8517092">
<p>
对 Insert Sort 的优化：由于 insert sort 比较仅针对前一个元素，如果数组逆序严重，则需要太多次的比较和交换
</p>

<p>
Shell Sort 增大了比较的跨度，生成 partially sorted array，优化 insert sort 速度
</p>

<p>
Shell Sort 选择一个合适的 h 值，h 从大到小减小到 1，每次排序后生成 h-sorted array
</p>

<p>
书中给出的经验公式为 \(h = \frac{1}{2} ( 3^k - 1 )\)
</p>

<p>
Shellsort gains efficiency by making a tradeoff between size and partial order in the subsequences.
</p>

<p>
最差情况下，shell sort 的时间复杂度为 \(N^\frac{3}{2}\)
</p>

<div class="org-src-container">
<pre class="src src-java">public static void sort(Comparable[] a) {
    int N = a.length;
    int h = 1;
    while( h &lt; N/3 ) h = 3*h + 1;
    while( h &gt;= 1 ) {
	for ( int i = h; i &lt; N; i++ ) {
	    for ( int j = i; j &gt;= 0 &amp;&amp; less(a[j], a[j-h]); j-=h ) {
		exch(a, j, j-h);
	    }
	}
	h = h/3;
    }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbeb7054" class="outline-4">
<h4 id="orgbeb7054">SelectSort vs InsertSort</h4>
<div class="outline-text-4" id="text-orgbeb7054">
<dl class="org-dl">
<dt>Property D.</dt><dd>The running times of insertion sort and selection sort are quadratic and within a small constant factor of one another for randomly ordered arrays of distinct values.</dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-orga11bc7d" class="outline-3">
<h3 id="orga11bc7d">Merge sort</h3>
<div class="outline-text-3" id="text-orga11bc7d">
<p>
分治的思路 (divide and conquer)，将数组分成两部分分别进行排序，将已经排序好的两个序列进行合并
</p>

<p>
优势在于它的复杂度为 \(N \log(N)\) ，劣势在于需要额外的 N 的空间来进行合并
</p>

<dl class="org-dl">
<dt>PropositionF.</dt><dd>Top-down mergesort uses between 1⁄2NlgN and NlgN compares to sort any array of length N.</dd>
<dt>PropositionG.</dt><dd>Top-down mergesort uses at most 6NlgN array accesses to sort an array of length N.</dd>
<dt>PropositionH.</dt><dd>Bottom-upmergesortusesbetween1⁄2NlgNandNlgNcompares and at most 6N lg N array accesses to sort an array of length N.</dd>
</dl>


<p>
优化思路：
</p>
<ol class="org-ol">
<li>对于足够小的数组，使用 insert sort 替换 merge sort （如 15 个元素以下）</li>
<li>合并前判断 mid 与 mid+1 是否已经有序</li>
<li>去掉额外的用于合并结构存储空间</li>
</ol>
</div>
</div>

<div id="outline-container-org816c141" class="outline-3">
<h3 id="org816c141">QuickSort</h3>
</div>

<div id="outline-container-org08e14ab" class="outline-3">
<h3 id="org08e14ab">HeapSort</h3>
</div>
</div>

<div id="outline-container-orge10292a" class="outline-2">
<h2 id="orge10292a">视频笔记</h2>
<div class="outline-text-2" id="text-orge10292a">
<p>
视频与课本相关，后续将下面的章节分类到课本的章节中去
</p>
</div>

<div id="outline-container-org5686425" class="outline-3">
<h3 id="org5686425">Union Find</h3>
<div class="outline-text-3" id="text-org5686425">
</div><div id="outline-container-org1774eef" class="outline-4">
<h4 id="org1774eef">概述</h4>
<div class="outline-text-4" id="text-org1774eef">
<p>
对于给出的点集，检查各个点的联通性问题（dynamic connectivity problem）。
</p>

<p>
Union-Find 问题有两个基本操作 union 和 find，用 API 形式表示如下
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">method</th>
<th scope="col" class="org-left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>UF(int N)</code></td>
<td class="org-left">初始化 N 个 object 构成的点集</td>
</tr>

<tr>
<td class="org-left"><code>void union(int p, int q)</code></td>
<td class="org-left">连接 p 和 q 两个 object</td>
</tr>

<tr>
<td class="org-left"><code>boolean connection(int p, int q)</code></td>
<td class="org-left">检查 p 和 q 两个 object 是否相连</td>
</tr>
</tbody>
</table>

<p>
为了简化实现，用 index array 来存储点，以下标来进行标识。如果要实现通用的点集，可以考虑使用 symbol table
</p>

<p>
解决 union-find 问题有四种数据结构
</p>
<ol class="org-ol">
<li>quick find</li>
<li>quick union</li>
<li>weighted quick union</li>
<li>weighted quick union with path compression</li>
</ol>

<p>
常用于 percolation problem from physical chemistry
</p>

<p>
本节演示了如何设计一个算法
</p>
<ol class="org-ol">
<li>modeling the problem</li>
<li>find algorithm</li>
<li>fast enough? fits memory?</li>
<li>if not, figure out why</li>
<li>find a way to address the problem</li>
<li>iterate until staisfied</li>
</ol>
</div>
</div>

<div id="outline-container-org87af678" class="outline-4">
<h4 id="org87af678">Quick Find</h4>
<div class="outline-text-4" id="text-org87af678">
<p>
其本思路是
</p>
<ol class="org-ol">
<li>初始化时，用不同的 id 来标识不同的组（数组的索引）</li>
<li><p>
进行 union 操作时，遍历数组，将符合 p 对应的组 id 修改为 q 的组 id
</p>
<div class="org-src-container">
<pre class="src src-java">void union(int p, int q) {
    int pid = A[p];
    int qid = A[q];
    for(int i = 0; i &lt; N; i++) {
	if(A[i] == pid) {
	    A[i] = qid;
	}
    }
}
</pre>
</div></li>
<li>随着连接变多，组渐变少</li>
</ol>

<p>
本方法对应的算法复杂度如下所示
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">method</th>
<th scope="col" class="org-left">complexity</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">initial</td>
<td class="org-left">N</td>
</tr>

<tr>
<td class="org-left">union</td>
<td class="org-left">N</td>
</tr>

<tr>
<td class="org-left">find</td>
<td class="org-left">1</td>
</tr>
</tbody>
</table>

<p>
看出，当 N 较大时，union 开销较大
</p>
</div>
</div>

<div id="outline-container-orgf8338cf" class="outline-4">
<h4 id="orgf8338cf">Quick Union</h4>
</div>

<div id="outline-container-orgee8f0f7" class="outline-4">
<h4 id="orgee8f0f7">Weighted Quick Union</h4>
</div>

<div id="outline-container-org21a7ec3" class="outline-4">
<h4 id="org21a7ec3">Weighted Quick Union with Path Compression</h4>
</div>

<div id="outline-container-org624ef57" class="outline-4">
<h4 id="org624ef57">Analysis of Algorithm</h4>
<div class="outline-text-4" id="text-org624ef57">
<p>
计算机发展中，处理性能和内存同时提升。而处理性能的提升与因为内存增大而造成的处理器的提升成线性比例。也就是说曾经处理性能为 P 时，处理 Q 量的数据；现在处理性能为 1000P 时可能要求处理 1000Q 的数据。对于算法复杂度为 \(O(n^2)\) 的情况，实际上性能不升反降
</p>
</div>
</div>

<div id="outline-container-org031c683" class="outline-4">
<h4 id="org031c683">Performance Versus</h4>
</div>
</div>


<div id="outline-container-orgab42eda" class="outline-3">
<h3 id="orgab42eda">其它</h3>
<div class="outline-text-3" id="text-orgab42eda">
</div><div id="outline-container-org6da567f" class="outline-4">
<h4 id="org6da567f"><span class="todo TODO">TODO</span> Symbol Table</h4>
</div>
</div>
</div>
<div id="outline-container-org461d7cb" class="outline-2">
<h2 id="org461d7cb">延伸阅读</h2>
<div class="outline-text-2" id="text-org461d7cb">
<ul class="org-ul">
<li>An Introduction to programming in Java: An interdisciplinary approach</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Larry</p>
<p class="date">Created: 2018-03-21 三 17:10</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
